In [11]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [12]:
Ages = [5,6,7,8,9,10]
Boys = [432,379,501,410,420,418]
Girls = [408,513,412,436,461,500] 

df = pd.DataFrame({'Boys':Boys,'Girls':Girls})

In [13]:
df.head()
df

   Boys  Girls
0   432    408
1   379    513
2   501    412
3   410    436
4   420    461
5   418    500

In [14]:
df=df.T

In [15]:
df.columns = Ages

In [16]:
df

        5    6    7    8    9    10
Boys   432  379  501  410  420  418
Girls  408  513  412  436  461  500

In [19]:
df = pd.read_excel(r'C:\Users\rfran26\Documents\Boys Girls.xlsx')

In [21]:
df

        5    6    7    8    9    10
Boys   432  379  501  410  420  418
Girls  408  513  412  436  461  500

In [23]:
Ages

[5, 6, 7, 8, 9, 10]

In [24]:
df2 = df

In [25]:
for i in Ages:
    df2.loc['Totals',i] = df2.loc['Boys',i] + df2.loc['Girls',i]

In [26]:
df2

           5      6      7      8      9      10
Boys    432.0  379.0  501.0  410.0  420.0  418.0
Girls   408.0  513.0  412.0  436.0  461.0  500.0
Totals  840.0  892.0  913.0  846.0  881.0  918.0

In [28]:
## What is the Probability of selecting a boy?

In [34]:
totals = df2.sum(axis=1)['Totals']

In [35]:
print(totals)

5290.0

In [37]:
df2.sum(axis=1)['Boys']/totals

0.4839319470699433

In [38]:
## What is the Probability of selecting a 7 year old?

In [40]:
df2.loc['Totals',7]/totals

0.17258979206049149

In [41]:
## What is the Probability of selecting a boy that's 10 years old??

In [43]:
df2.loc['Boys',10]/totals

0.079017013232514172

In [44]:
## What is the probability of selecting a child (boy or girl) who is at least 8 years of age?

In [45]:
df2.loc['Totals',8:11]/totals

8     0.159924
9     0.166541
10    0.173535
Name: Totals, dtype: float64

In [46]:
np.sum(df2.loc['Totals',8:11]/totals)

0.5

In [47]:
sum(df2.loc['Totals',8:11]/totals)

0.5

In [48]:
## Probability of selecting a 9 year odl girl out of only the Girls?

In [50]:
df2.loc['Girls',9]/sum(df2.loc['Girls',:])

0.16886446886446888